CSI API ETABS v1
cCaseStaticNonlinear.SetLoadApplication Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadApplication(
	string Name,
	int LoadControl,
	int DispType,
	double Displ,
	int Monitor,
	int DOF,
	string PointName,
	string GDispl
)
Function SetLoadApplication (
	Name As String,
	LoadControl As Integer,
	DispType As Integer,
	Displ As Double,
	Monitor As Integer,
	DOF As Integer,
	PointName As String,
	GDispl As String
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim LoadControl As Integer
Dim DispType As Integer
Dim Displ As Double
Dim Monitor As Integer
Dim DOF As Integer
Dim PointName As String
Dim GDispl As String
Dim returnValue As Integer
returnValue = instance.SetLoadApplication(Name,
	LoadControl, DispType, Displ, Monitor,
	DOF, PointName, GDispl)
int SetLoadApplication(
	String^ Name,
	int LoadControl,
	int DispType,
	double Displ,
	int Monitor,
	int DOF,
	String^ PointName,
	String^ GDispl
)
abstract SetLoadApplication :
        Name : string *
        LoadControl : int *
        DispType : int *
        Displ : float *
        Monitor : int *
        DOF : int *
        PointName : string *
        GDispl : string -> int
Parameters
Name
Type: System.String
LoadControl
Type: System.Int32
DispType
Type: System.Int32
Displ
Type: System.Double
Monitor
Type: System.Int32
DOF
Type: System.Int32
PointName
Type: System.String
GDispl
Type: System.String
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace